import { I18n } from '../enums/i18n-text';

const RU = {
    [I18n.UPLOAD_FILE]: 'Нажмите и выберите или перетащите файл .xlsx',
    [I18n.USER_SEARCH]: 'Поиск пользователя...',
    [I18n.HUNT]: 'Охота',
    [I18n.PURCHASE]: 'Покупки',
    [I18n.ALL]: 'Все',
    [I18n.TOTAL]: 'Всего',
    [I18n.COPY]: 'Скопировать',
    [I18n.USERS]: 'игроков',
    [I18n.FAILED]: 'проваливших',
    [I18n.FAILED_HUNT]: 'Охоту',
    [I18n.PERSENTAGE_CHECKBOX]: 'Отображать процент выполнения',
    [I18n.USER_ACTIVITY]: 'Действия',
    [I18n.HUNT_STATS]: 'Статистика охоты',
    [I18n.PURCHASE_STATS]: 'Статистика покупок',
    [I18n.TOTAL_POINTS]: 'Всего очков',
    [I18n.USER_STATS]: 'Статистика пользователя',
    [I18n.GUILD_STATS]: 'Статистика гильдии',
    [I18n.BACK]: 'Назад',
    [I18n.L1]: 'Ур 1',
    [I18n.L2]: 'Ур 2',
    [I18n.L3]: 'Ур 3',
    [I18n.L4]: 'Ур 4',
    [I18n.L5]: 'Ур 5',
    [I18n.ABOUT_WEBSITE]: 'О сайте',
    [I18n.ABOUT_CREATOR]: 'Об авторе',
    [I18n.FUTURE_OF_THE_PROJECT]: 'Будущее проекта',
    [I18n.LINKS]: 'Ссылки',
    [I18n.ABOUT_WEBSITE_TEXT]: `
        Загрузите файл excel в <span>LMStats</span>, и вы сможете увидеть свои показатели и показатели друзей по гильдии. 
        Вы можете скопировать список пользователей, которые провалили охоту, 
        покупки или все задания с процентами прогресса завершения или без них.
    `,
    [I18n.ABOUT_CREATOR_TEXT]: `
        <span>ZloyHomyak13</span> - мой ник в Lords Mobile, 
        Вы можете связаться со мной, если у вас есть вопросы, 
        идеи, как улучшить сайт или вы столкнулись с ошибками здесь. 
        Я исправлю их как можно скорее.
    `,
    [I18n.FUTURE_OF_THE_PROJECT_TEXT]: `
        Я собираюсь создать сервер и добавить систему учетных записей. 
        Лидер или офицеры вашей гильдии создадут гильдию и примут ваш запрос на вступление, 
        и <span>только они</span> смогут загрузить файл сюда, все члены гильдии увидят свою статистику 
        <span>без загрузки файла</span>. Если этот проект будет популярен, я подумаю о дополнительных функциях,
        таких как анализ данных за несколько месяцев с удобными графиками.
    `,
    [I18n.LINKS_TEXT]: `
        <p>Исходный код:</p>
        <a target="_blank" href='https://github.com/Dimdim28/LMStats'>https://github.com/Dimdim28/LMStats</a>
        <p>Мой профиль Github:</p>
        <a target="_blank" href='https://github.com/Dimdim28'>https://github.com/Dimdim28</a>
    `,
};

export default RU;
